jorgebucaran/fisher
ilancosman/tide@v6
patrickf1/fzf.fish
jorgebucaran/autopair.fish
danhper/fish-ssh-agent
decors/fish-colored-man
nickeb96/puffer-fish
meaningful-ooo/sponge
