# Taps
tap "abdfnx/tap"
tap "ankitpokhrel/jira-cli"
tap "bloznelis/tap"
tap "charmbracelet/tap"
tap "danvergara/tools"
tap "elastic/tap"
tap "felixkratz/formulae"
tap "guumaster/tap"
tap "hashicorp/tap"
tap "kde-mac/kde", "https://invent.kde.org/packaging/homebrew-kde.git"
tap "kha7iq/tap"
tap "koekeishiya/formulae"
tap "lusingander/tap"
tap "mk-5/mk-5"
tap "mkchoi212/fac", "https://github.com/mkchoi212/fac.git"
tap "muandane/tap"
tap "nikitabobko/tap"
tap "noahgorstein/tap"
tap "noborus/tap"
tap "omnisharp/omnisharp-roslyn"
tap "rockorager/tap"
tap "tako8ki/tap"
tap "ynqa/tap"
tap "yudai/gotty"

# Softwareee
brew "angle-grinder"
brew "ast-grep"
brew "atuin"
brew "autoconf"
brew "axel"
brew "bandwhich"
brew "bat"
brew "bear"
brew "bettercap"
brew "bitwise"
brew "bloznelis/tap/typioca"
brew "bmon"
brew "boost"
brew "btop"
brew "chafa"
brew "cidr"
brew "circumflex"
brew "clang-format"
brew "clipboard"
brew "cmake"
brew "coreutils"
brew "cotp"
brew "ctop"
brew "curl"
brew "curlie"
brew "danvergara/tools/dblab"
brew "dbus", restart_service: :changed
brew "delta"
brew "dive"
brew "dos2unix"
brew "doxygen"
brew "dpkg"
brew "dua-cli"
brew "duf"
brew "dust"
brew "eget"
brew "extra-cmake-modules"
brew "eza"
brew "fastfetch"
brew "fastmod"
brew "fd"
brew "fish"
brew "fzf"
brew "fzy"
brew "gemini-cli"
brew "gettext"
brew "gh"
brew "ghq"
brew "gitleaks"
brew "glow"
brew "gmp"
brew "gnupg"
brew "go"
brew "go-task"
brew "golangci-lint"
brew "graphviz"
brew "gum"
brew "hashicorp/tap/packer"
brew "hexyl"
brew "htop"
brew "hwatch"
brew "hyperfine"
brew "icdiff"
brew "icu4c@76"
brew "ifstat"
brew "iproute2mac"
brew "jemalloc"
brew "jnv"
brew "jq"
brew "jqp"
brew "keydb"
brew "kha7iq/tap/pingme"
brew "lazygit"
brew "libconfig"
brew "libevent"
brew "libpcap"
brew "libpq"
brew "libuv"
brew "llvm"
brew "llvm@17"
brew "lnav"
brew "lua"
brew "luarocks"
brew "lusingander/tap/stu"
brew "mimalloc"
brew "mk-5/mk-5/fjira"
brew "msgpack-tools"
brew "navi"
brew "ncurses"
brew "neovim"
brew "ninja"
brew "nixfmt"
brew "nmap"
brew "noborus/tap/ov"
brew "node"
brew "noti"
brew "nowplaying-cli"
brew "onefetch"
brew "opentofu"
brew "ouch"
brew "p7zip"
brew "pandoc"
brew "parallel"
brew "pastel"
brew "pingme"
brew "pipx"
brew "pixz"
brew "postgresql@14"
brew "procs"
brew "protobuf"
brew "pueue"
brew "pueue", restart_service: :changed
brew "python@3.12"
brew "qemu"
brew "rclone"
brew "ripgrep"
brew "ripgrep-all"
brew "rockorager/tap/prise"
brew "rsync"
brew "rust"
brew "rustup"
brew "scdoc"
brew "sd"
brew "shellcheck"
brew "sqlite"
brew "squashfs"
brew "sshs"
brew "starship"
brew "switchaudio-osx"
brew "taplo"
brew "tcpdump"
brew "tcpreplay"
brew "tea"
brew "tealdeer"
brew "timg"
brew "tmux"
brew "tokei"
brew "tree-sitter"
brew "trippy"
brew "typespeed"
brew "wget"
brew "wireguard-tools"
brew "xh"
brew "xxhash"
brew "xz"
brew "yazi"
brew "ynqa/tap/sigrs"
brew "yq"
brew "zellij"
brew "zoxide"
brew "zstd"

# Casks
cask "aerospace"
cask "cutter"
cask "docker-desktop"
cask "flameshot"
cask "ghostty"
cask "hammerspoon"
cask "hex-fiend"
cask "kitty"
cask "sf-symbols"
cask "sloth"
cask "sublime-merge"
cask "teamviewer"
cask "wezterm-nightly"
cask "wireshark"
cask "zerotier-one"

# Golang tools 
go "github.com/air-verse/air"
go "github.com/spf13/cobra-cli"
go "github.com/dim-an/cod"
go "github.com/schollz/croc/v10"
go "golang.org/x/tools/cmd/deadcode"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/mr-karan/doggo/cmd/doggo"
go "github.com/charmbracelet/freeze"
go "golang.org/x/tools/cmd/godoc"
go "mvdan.cc/gofumpt"
go "github.com/segmentio/golines"
go "golang.org/x/tools/gopls"
go "github.com/TypicalAM/goread"
go "github.com/melbahja/got/cmd/got"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/dl/gotip"
go "github.com/kencx/keyb"
go "github.com/CryoViking/md-preview"
go "github.com/dhth/omm"
go "github.com/brittonhayes/pillager/cmd/pillager"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/allyring/pvw"
go "github.com/projectdiscovery/simplehttpserver/cmd/simplehttpserver"
go "github.com/lotusirous/gostdsym/stdsym"
go "github.com/aandrew-me/tgpt/v2"
go "github.com/Owloops/updo"

# Rust Tools
cargo "bp"
cargo "havn"
cargo "rust-stakeholder"
cargo "skim"
