jorgebucaran/fisher
jorgebucaran/fish-bax
jethrokuan/fzf
decors/fish-colored-man
danhper/fish-ssh-agent
jorgebucaran/spark.fish
gazorby/fish-abbreviation-tips
jorgebucaran/autopair.fish
catppuccin/fish
takashabe/fish-fzf
ilancosman/tide@v5
